[
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=sophia-zaborowski&pid=199564089", "deceased_name": "SOPHIA ZABOROWSKI", "year_born_died": "1922 - 2021", "message": "\n      ZABOROWSKI, SOPHIA Born to Anna and Stanley Borek, on September 13, 1922, Sophie passed away, on Wednesday, July 21, 2021, in her 99th year, at St. Joseph's Health Centre in Guelph. She was the beloved wife of the late Chester (1988). Proud and loving mother of Ann Zaborowski of Kitchener, Garry Zaborowski (Mary) of Rockwood, Joe Zaborowski of Cambridge and the late Adele Joanne Zaborowski-Stuart (1993). Cherished Baci of Ches and Carly. Sophie was the dear sister of Blanche Zylka (late Leo) and the late Chester. A Memorial visitation will be held on Monday, July 26, 2021 from 7 – 9 p.m. with the Memorial Service on Tuesday, July 27, 2021 at 1:00 p.m. at GILCHRIST CHAPEL – McIntyre & Wilkie Funeral Home, One Delhi Street, Guelph. Interment of cremated remains to follow at Marymount Cemetery. Please understand that we will be following social distancing protocols due to COVID-19 and masks are required. Please contact the funeral home at 519-824-0031 to indicate you would like to attend the visitation and/or the service (we will be collecting names and phone numbers for contact tracing). We ask that you do not attend if feeling unwell or have been in contact with someone who has tested positive for COVID-19. If desired, memorial contributions may be made to the ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=ren-e-unger&pid=199345454", "deceased_name": "Renée UNGER", "year_born_died": null, "message": "\n      UNGER, Renée Peacefully, on July 3, 2021, with her three daughters having never left her side, Renée Unger passed from this physical life into her new spiritual life. Without question, our beautiful, brilliant, dynamic and spirited mother, Renée Unger, leaves behind many a legacy; her most significant being the greatest mother and grandmother and creating the infamous Renée's Gourmet Salad Dressings. Born December 11, 1942, Renée was the youngest child of Faye (Shankman) (deceased) and Albert Mendelson (deceased). Worlds Best Mother to Alysse (Andrew Luepann), Lori (Alan Gutmann) and Karen (Paul Burstein) and \"Best Bubs\" to Ethan, Kaitlyn, Cole and Jamey Luepann, Noah, Layla and Zach Gutmann, and Jax, Jazzy, LJ and Emme Burstein. Sister to Marilyn Greenglass (deceased) and Edward Mendelson (deceased). Sadly missed by her best friend, cousin and \"sister\" Irma Rotstein, and our father Arnie Unger, cofounder of Renée's Gourmet, with whom she always maintained a special relationship. After majoring in mathematics at the University of Toronto, Mom went on to receive her teaching degree. Already a fabulous cook, she used her extraordinary culinary skills to make all-natural salad dressings for family and friends in our home kitchen. In 1985, together with our dad, they created Renée's Gourmet Salad Dressings, which quickly became a family favourite in homes across Canada. Though she was a celebrity in the culinary world, she never forgot her roots. Always thinking of others, our mom was a \"humble and quiet\" philanthropist. She taught us to always have empathy in others and to give with our hearts. All eleven of her grandchildren will forever remember her as the cutest, coziest and coolest Bubbie ever. She had a special place for each and every one of them, often talking stocks, cooking, fashion, books, Broadway, movies, music and sports. Our mother's passion for sports, especially for the Toronto Blue Jay's, tennis, football, basketball and hockey was passed on to each and every one of our kids. Without a doubt our mom left an impression on everyone with whom she ever came in contact. She will forever have a prominent place in our hearts and minds. She will continue to be an inspiration to us all. We love you Mommy with all our hearts. Our hearts are broken, but your love and legacy will live on - to infinity and beyond. Love, your \"three best dots\" - Alysse, Lori and Karen", "published_source": "Published in Toronto Star from Jul. 6 to Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=anita-twist&pid=199564077", "deceased_name": "ANITA TWIST", "year_born_died": null, "message": "\n      TWIST, ANITA (nee GOULET) Died peacefully, July 18, 2021. She is resting beside her beloved husband Bill at St. John's Norway Cemetery. Missed so very much. Rest in Peace Anita.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=helen-marian-tracz&pid=199571785", "deceased_name": "Helen Marian TRACZ", "year_born_died": "1928 - 2021", "message": "\n      TRACZ, Helen Marian (nee MISURKA) It is with great sadness that the family of Helen announces that after a short illness, she passed away peacefully, on July 22, 2021. Born on October 20, 1928, Helen led a wonderfully long life. Beloved wife of the late Roman, daughter of the late Jacob and Pearl Misurka, and sister of the late Walter Misurka (Stella) and Zon Beland (Ernie). Helen is lovingly remembered by her daughters Kathryn Tracz (Robert Valiquette) and Adrianna Rogers (Stephen), her grandchildren Andrew, Thomas (Lee-Ann), Marianne, Stephen, and Emily, three generations of nieces and nephews, as well as extended family and many friends. Helen was a long-standing employee of Canadian General Electric, Ericsson, and a member of St. Demetrius Church. She was a kind and wonderful woman who will be missed by all who knew her. Private family gathering. Webcast funeral will be celebrated on Monday, July 26, 2021, at 1 p.m. In lieu of flowers, the family would appreciate donations in Helen's memory be sent to the Hospital for Sick Children where Helen was a volunteer. Online condolences at: ", "published_source": "Published in Toronto Star on Jul. 25, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=mary-sumeraj&pid=199564047", "deceased_name": "Mary SUMERAJ", "year_born_died": null, "message": "\n      SUMERAJ, Mary With heavy hearts we announce the death of Mary Sumeraj, age 90, on July 16, 2021, at Joseph Brant Hospital in Burlington. Mary was born in Montreal living most of her life in Oakville and Burlington. Mary is forever reunited with the love of her life, Frank Sumeraj. Cherished mother of Jean (husband Monty), Sharon (husband Dave) and Judy (husband Gary) as well as proud grandmother of Heather, Matthew, Ryan, Cory, Mitchell and Kristen. Mary loved to garden, cook, travel, bowl and in her later years, play Bingo. Mary also cherished gathering with her family. There will be a private funeral for the family on Monday, July 26th at Glen Oaks Funeral Home. In lieu of flowers, a donation to the Multiple Sclerosis Society of Canada or Diabetes Canada would be appreciated by the family. ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=j-f-beverley-stoddart&pid=199564070", "deceased_name": "J.F. BEVERLEY STODDART", "year_born_died": null, "message": "\n      STODDART, J.F. BEVERLEY Bev passed away peacefully on July 15, 2021, at the age of 89. He is survived by his beloved wife of 67 years, Elinora; children, Ruth and Warren (Catherine); and grandchildren, Madeleine and Jake. Cremation has taken place and there will be a private family gathering in his memory. Messages of sympathy can be sent via ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=slavka-stajan&pid=199564091", "deceased_name": "Slavka STAJAN", "year_born_died": "1927 - 2021", "message": "\n      STAJAN, Slavka February 14, 1927 - July, 21 2021 Passed away peacefully at Dom Lipa, a nursing home where she also devoted over 20 years of volunteer service. Slavka's family was by her side, praying and singing songs for her heart until it was quiet. She always loved the quiet. There was always poetry in her life, she wrote verses of life's moments and experiences. Slavka touched the lives of her family, friends and Slovenian community. With her unwavering faith, gentle spirit and compassionate nature, she was a perfect complement to her loving and vibrant husband Ludvik. She was happy when her family was happy. Mother of Bill (Mary), Mike (Nada), Andrea (Stan Ferkul), Carol (Kevin LaPlante) and the late Robert. She will be dearly missed by her grandchildren who brought her great joy: Jason (Jeannia), Marty (Julie), Michael (Irena), Thomas (Karla), Michelle (Darius), Matthew (Katie), Nadia (Aaron), Maya, David (Erica), Mark, Jake, Jenna (Ian), Robert (Erika), Jonathan; and her great-grandchildren: Jackson, Joshua, Juno, Benjamin, Ava, Max, Nathan, Maya, Stella, Emerson (deceased), Elliot, Dylan, Dalia, Olivia, Cyrus, Eva and Noah. Slavka will also be greatly missed by her brother John, sister Joža, extended family and friends in Canada and Slovenia. A special thank you to Anjar for her dedication and care, and to the kind-hearted staff at Dom Lipa. Friends will be received at Our Lady of the Miraculous Medal Catholic Church, 739 Browns Line, on Monday, July 26th from 4-8 p.m. Funeral mass to be held in person and online at Our Lady of the Miraculous Medal Catholic Church, on Tuesday, July 27th at 10 a.m., interment to follow at Mt. Peace Catholic Cemetery, Mississauga. In lieu of flowers, donations to Dom Lipa would be appreciated by the family. Messages of condolences may be placed at: ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=edwin-john-rix&pid=199576572", "deceased_name": "DR. EDWIN JOHN RIX", "year_born_died": null, "message": "\n      RIX, DR. EDWIN JOHN December 1928 - July 2021 Edwin passed away peacefully, on Wednesday, July 21, 2021, at Trillium Health Centre, Mississauga. Predeceased by his beloved wife of 61 years, Mary. Loving father of Martyn (Linda), Michael (Brenda), Carolyn Mawdsley (Gord) and Jonathan (Karen). Proud grandfather of Erin (Jeff), Graham, Matthew, Geoffrey (Jessica), Nathaniel, Alanna, Samantha (Austin) and Melody. Cherished great-grandfather of Toren, Nevis, Porter, Charlie and Jasmine. Dear brother of Christine and predeceased by his sister, Hazel Read (Arnold) and brother, Patrick. Edwin was a physician and a musician, but first a servant and devoted follower of Jesus Christ. He will be remembered with affection by his extended family and many friends. Visitation will be at the Glen Oaks Memorial Chapel & Reception Centre, 3164 Ninth Line (Dundas/403) in Oakville, on Wednesday, July 28th from 3-7 p.m., by registration only. A private funeral service will be held on Thursday, July 29th at 12:30 p.m., followed by a burial service. Both will be available for livestreaming. In lieu of flowers, please consider donations to MSC Canada or The Gideon's. Please visit ", "published_source": "Published in Toronto Star on Jul. 26, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=phyllis-delora-ricketts&pid=199546025", "deceased_name": "Phyllis Delora RICKETTS", "year_born_died": "1943 - 2021", "message": "\n      RICKETTS, Phyllis Delora (nee ARSCOTT) Affectionately known as Mother Ricketts, passed away peacefully into eternity on Monday, July 19, 2021, at Michael Garron Hospital, at the age of 98. She was born in Clarendon, Jamaica. On April 25, 1943, Phyllis married the late Bishop Cecil O'Sullivan Ricketts, who predeceased her in 2015, months before his 100th birthday, after 72 years of love and marriage. Together, the Ricketts' immigrated to Canada in 1952. Mother Ricketts was a formidable, yet graceful woman of poise, elegance and class, who lovingly referred to everyone around her as \"Dear\". Mother Ricketts modelled the Christian life and inspired hope in countless people. Her words were always calm yet strong enough to inspire hope and confidence in the hearts of the hearers. With joy and optimism, she guided newcomers to Canada, tactfully nurtured youth, and young families; she also mentored women and emerging leaders. Full of love, gentleness, and compassion, she advocated for and engaged in charity work to support marginalized individuals in the community. The memory and legacy of Mother Ricketts will live on through her beloved family and the Mount Zion Apostolic Church community. She is survived by: Lloyd, Ron (Sybil), Winsome (Monroe), Marene, Beverly, and eight grandchildren: Christine (Patrick), Shawn (Ann-Marie), Duane (Theresa), Darwin (Brandi), Michael (Tanya), Candice (Darryl), Michelle, Andrew, and 14 great-grandchildren. Resting at Ogden Funeral Homes at 4164 Sheppard Avenue East, Agincourt, ON. Visitation will be on Thursday, July 22 from 3:00 to 6:00 p.m. As per COVID-19 restrictions, a private Homegoing Service will be held at the Mount Zion Apostolic Church-Toronto (30 Pemican Court, Toronto, ON). Well-wishers are welcomed to attend online at ", "published_source": "Published in Toronto Star on Jul. 22, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=marjorie-jean-philip&pid=199571784", "deceased_name": "MARJORIE JEAN PHILIP", "year_born_died": "1921 - 2021", "message": "\n      PHILIP, MARJORIE JEAN (nee FOX) Peacefully, on Friday, July 23, 2021, at Campbell House Hospice in Collingwood. Marjorie was born in Hamilton, Ontario, on June 8, 1921, to John and Margaret Fox. She was predeceased by her husband Prior Philip, her sister Eleanor MacKay, Prior's son Michael Philip, Prior's granddaughter Nishka Philip and her cousin Dawn Fiddes. She is survived by her niece Anne and family, her niece Laura and family, Prior's son Sinclair and family and Dawn's family. After studying at Hamilton Normal School, McMaster University in Hamilton, Ontario, the Sorbonne in Paris, France and Middlebury College in Middlebury, Vermont, Marjorie followed a teaching career in St. George, Brantford and Oakville, Ontario. In 1976, Marjorie married Prior and retired to Woodland Beach, where they enjoyed travelling, bird watching, golfing and taking in the view of Nottawasaga Bay. According to Marjorie's wishes, cremation has taken place, with arrangements entrusted to the Lynn-Stone Funeral Home in Elmvale, Ontario. There will be no visitation or funeral services. A private family interment will be arranged at a future date. In lieu of flowers, the family would ask that you consider a donation to the Nature Conservancy of Canada, Campbell House Hospice, 240 Erie St., Collingwood, Ontario L9Y 0X8, or the charity of your choice. Heartfelt thanks go to the Waterside Retirement Lodge in Wasaga Beach for the loving care of Marjorie over the last few years. Thanks also to the Campbell House Hospice for the gentle care given to her in these last few days. Expressions of sympathy may be sent to: ", "published_source": "Published in Toronto Star on Jul. 25, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=paula-patricia-o-keeffe&pid=199564055", "deceased_name": "PAULA PATRICIA O'KEEFFE", "year_born_died": "1947 - 2021", "message": "\n      O'KEEFFE, PAULA PATRICIA (nee O'NEILL) 1947 - 2021 Paula died peacefully, Friday, July 16, 2021, at the age of 74. She will be forever missed by Denis, her loving husband of 52 years, her sister Joyce (Joe) of Reading, England and her brother, Robert of Macroom, Ireland. As per Paula's wishes, there will be no service. In lieu of flowers, donations in her name may be made to Sunnybrook Foundation, Odette Cancer Program, Toronto.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=dorothy-mary-murphy&pid=199564090", "deceased_name": "Dorothy Mary MURPHY", "year_born_died": null, "message": "\n      MURPHY, Dorothy Mary (nee STITT) It is with great sadness that we announce Dorothy Mary Murphy, 90, of Toronto, passed away on Monday, July 19, 2021, with her three children, Shawn (Kathy), Shelley (Rich) and Cheryl (David) by her side. Dorothy will be deeply missed by her children and grandchildren, Danielle, Noah, Megan, Ben and Mason. She will be remembered for living her life with profound joy, unbridled spirit and an unwavering commitment and love for her family. The family wish to send a special thank you to the staff at the Toronto Grace Palliative Care Unit for their care and compassion.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=carol-lorraine-murphy&pid=199503568", "deceased_name": "CAROL LORRAINE MURPHY", "year_born_died": null, "message": "\n      MURPHY, CAROL LORRAINE (nee WALLACE) 1957 - 2021 It is with great sadness we announce that on July 11, 2021 Carol passed away peacefully at home, with all her children by her side. Carol was a beacon of love, comfort and generosity and will be greatly missed by husband Sean, sons Kevin (Stephanie) and Andrew (Arianna), daughters Lora (William), Nicole and Yvonne, sisters Sharon (John) and Lynne (Duncan), brothers Dennis (Anne) and David (Star), five adoring grandchildren, many nieces, nephews and dear friends. Carol had wonderful and deep friendships that sustained her throughout her life and never more than in these final months while she was fighting cancer. As a family, we could not have been more impressed by the palliative teams in Scarborough. Deep gratitude to the Oncology team at Scarborough General Hospital, the Odette Cancer Centre at Sunnybrook and special thanks to the MAID team that brought so much compassion and support to Carol's final decision. Carol was loved and admired by so many and we will be celebrating her life and beautiful spirit on Saturday, July 24th from 12:30-3:30 p.m. at Prague Restaurant, 450 Scarborough Golf Club Road, Toronto.", "published_source": "Published in Toronto Star on Jul. 20, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=peter-barrie-mosher&pid=199564087", "deceased_name": "PETER BARRIE MOSHER", "year_born_died": null, "message": "\n      MOSHER, PETER BARRIE It is with great sadness we announce the passing of Peter Barrie Mosher, a loving husband and dedicated father, on Monday, July 12, 2021. For his wife Marilyn Roycroft, his son Max and his partner Kirk, his son Tom and his partner Madisyn, and the countless others whose lives he touched, he will live on through his stories and our beloved memories. Peter had a deep well of knowledge and never lost his passion for learning new things. His intelligence was matched by his irrepressible humour. He loved making everyone laugh at family dinners, or reading on the porch or near the lake at the family cottage on Snake Island (quietly, until he found a passage he had to share with whoever was closest). Peter was born in Halifax in 1941 to parents Phyllis Gormley and Roy Milton Mosher. The eldest of four – Thomas, Kenneth and Geoffery followed – he took to reading early, sometimes mispronouncing words he learned first from the printed page. He grew up in Saint John, New Brunswick, before studying science at McGill University. Independent from a young age, he took off on adventures working at mining camps up north. Then a one-year journalism course at Carleton University changed his life's direction. The Globe and Mail hired him as a reporter covering science, religion and politics. He eventually became the Queen's Park Bureau chief. He made the switch to politics, working with Bob Rae and later becoming his press secretary in the 1990's. It was through political work that he met Marilyn, who shared his commitment to making the world a better place. The pair travelled throughout Europe before purchasing a Victorian home on Brunswick Avenue in Toronto, where they were wed in 1983. Max was born in 1985 and Tom in 1988, and Peter threw himself into the role of Dad. He supported his sons unconditionally, encouraging them to be themselves, follow their own paths and achieve their best. Peter was a good man whose intellect, humour and capacity to love were unrivalled. We will keep him close to us always. In lieu of flowers, we ask that you donate to a charity of your choice - remembering that Peter always championed the underdog. We are grateful for our public healthcare system and for the medical staff at both Toronto Western and Toronto General Hospitals. They gave Peter excellent care and showed our family much kindness.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=deborah-mae-mckenna&pid=199564093", "deceased_name": "Deborah Mae McKENNA", "year_born_died": "1950 - 2021", "message": "\n      McKENNA, Deborah Mae 1950 - 2021 It is with great sadness that the family of Debbie McKenna (nee Roome-Smith) announces her sudden passing, on Monday, July 19th. She is survived by husband Bruce, son Sean (Heather), daughter Lindsey and grandchildren Jakob, Nathan and Emily. Her son, Ian, died in 1990. Debbie will be greatly missed by her mother Florence Smith (the late John Smith); brother Douglas, his sons Nathan (Leslie) and Jeremy (Alison) and daughter Tasha (Kerry); sister Heather (Rockey), their son David, daughter Jessica (Kevin); and sister Jackie and her son Kyle. Debbie will also be greatly missed by Bruce's mother Jean McKenna (the late J. Edward McKenna); brother-in-law Ed (Cindy), their daughters Meghan and Morag; sister-in-law Katherine (Paul), their son Evan; brother-in-law Graeme (Lillian), and his son Liam. Debbie obtained her B.A. from the University of Waterloo in 1973. She supported the family when Bruce went to law school and while raising 3 children was a member of the Junior League of Toronto, a Director of the North Toronto Figure Skating Club, a volunteer at her children's school and a Co-President of John Fisher Public School Parent's Association. Later, after a tragic car accident in which her youngest child, Ian, died, she started to volunteer and do supply work at various Canadian Mothercraft Society's Child Care Centres. She earned her Early Childhood Education Diploma at Canadian Mothercraft Society's School of Child and Family Studies, receiving the Robertson Prize and Certificate of Recognition and was the Class Valedictorian of 1995. She also received a George Brown College of Applied Arts and Technology Certificate in Day Care Management Program. Debbie was accomplished professionally. After the ECE diploma noted above, she worked as a Nursery and Junior Kindergarten assistant teacher at the University of Toronto, Institute of Child Studies; she worked as an instructor at Canadian Mothercraft Society's School of Child and Family Studies; she worked as a Child Development Counsellor at Breaking the Cycle and for ten years as a Senior Infant and Child Development Consultant, at The Regional Municipality of Durham. Debbie was positive, open and friendly to the world (every walk down the street was a series of extended conversations with neighbours, store clerks and workers). Debbie, we will miss you. In accordance with Debbie's express wishes, there is no visitation or memorial service. She was cremated and interred next to her son Ian's grave at Mount Pleasant Cemetery on Friday, July 23, 2021. If desired, contributions can be made to The Hospital for Sick Children at: ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=evlyn-louise-mcgivney&pid=199564067", "deceased_name": "EVLYN LOUISE McGIVNEY", "year_born_died": null, "message": "\n      McGIVNEY, EVLYN LOUISE Evlyn Louise McGivney, wife to Austin Riley, mother to Jaimmie, step-mother to Shane, Ashley and Erin, youngest child of John Francis McGivney and Margaret Helen McGrorey McGivney and much loved, admired sister of Mary Weinert, John McGivney (Sheila), Patricia McGivney (deceased) and Joan McGivney (Tom Hanes), aunt and great-aunt of many nieces and nephews, and friend and mentor to many, passed away at home surrounded by family on July 14, 2021. Evlyn graduated from law school at University of Western Ontario in 1974 and was called to the Bar in 1976. She retired from her family law practice in 1996 after 20 years as a lawyer. She was proud to be invited as a member of the \"Grey Beards\" and to have entertained her fellow lawyers with bawdy ballads as a member of \"Carole and the Carriage Trade\". Evlyn was always up for an impromptu grammar lesson, a word of advice, or an in depth conversation about any topic. She expanded the definition of family and held us all close within it. Her family would like to extend a special thank you to Drs. Meuser and Schneider and nurses Yuri, Priscilla and Joan and the entire palliative care team at Mt. Sinai. At Evlyn's request, there will be no funeral service. Please consider a donation in Evlyn's memory to the Temmy Latner Centre for Palliative Care or the Red Door Family Shelter.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=bernard-makhan-ben&pid=199564071", "deceased_name": "DR. BERNARD (BEN) MAKHAN", "year_born_died": "1936 - 2021", "message": "\n      MAKHAN, DR. BERNARD (BEN) September 17, 1936 - July 10, 2021 Dr. Ben Makhan passed away on Saturday, July 10, 2021, after a long battle with cancer. Predeceased by his late wife, Zeta Makhan, his son, Ben (Benny) Makhan and siblings, Ruth, Pat, Henri and Mickey, he is survived by four daughters that include Kamla Makhan (Gary Clewley), Dr. Sharmila Makhan (David Vousden) and Tamara Sanowar-Makhan; granddaughters, Ariana Zeppieri-Makhan (Anderson Todd), Elysse Vousden-Makhan and Madeleine Vousden-Makhan; brothers, Reynold (Leela), Chris, Winston (Donna) and Fr. Michael Makhan; sisters, Marie Makhan (Mike) and Molly James (Cliff ), and many nieces and nephews. Born in Trinidad, Ben attended St. Mary Catholic College where he was a scholarship student, cricket captain and avid sportsman. His love of academics, reading and sports continued throughout his life. He attended Dalhousie University in Halifax, Nova Scotia where he graduated from medical school in 1963. With a special interest in Emergency Room medicine, Surgery, Obstetrics and Family Practice, he worked as an ER Physician in Trinidad & Tobago for one year then returned to Canada where he joined the Emergency and Family Medicine staff at Queensway General Hospital. There he practiced and held the position of Chief of Family Medicine (1974-1984), President of Medical Staff in 1986, and member of the Board of Governors. While practicing ER medicine, he also maintained a Family Medicine practice on Brown's Line, Toronto until 2012 when he retired on account of his cancer. Ben loved practicing medicine and cherished all his patients, colleagues, fellow staff and peers as they brought much happiness to his life. Unfortunately, Ben's personal life was not as successful as his professional life and in this obituary, he wanted to extend his sincere apology to his late wife and son, and surviving children, grandchildren and siblings for all the neglect and hurt they suffered on account of his actions and choices. In Ben's later years he resided at Viva Retirement Community in Mississauga. He truly enjoyed his time there and appreciated the company and friendship of his fellow community members. Ben also very much appreciated the wonderful care he received from the great staff and management. Ben was thankful for the blessing of all of his doctors and dentists and their staff, nurses and all at the Queensway Site Oncology clinic for the amazing care and treatment he received. The family would like to thank the First Responders, ER doctors, nurses and staff and Credit Valley Hospital for the compassionate care Ben received in his final moments of life, Dr. Winston Makhan for his helpful palliative care advice, Meadowvale Funeral Home/Cemetery and Graeme at Cremation Care Centre on Mimico Avenue for exceptional service provided during a very difficult time. Ben was privately cremated earlier this week. A Mass/service will be held in his honour on Monday, August 23rd at 11:00 a.m., at St. Catherine of Siena Catholic Church, 2340 Hurontario St., Mississauga, ON L5B 1N1, (905-272-1454), ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=marlyn-livermore-collins&pid=199564041", "deceased_name": "MARLYN (COLLINS) LIVERMORE", "year_born_died": null, "message": "\n      LIVERMORE (COLLINS), MARLYN Peacefully, at Victoria Hospital in London, Dr. Marlyn Livermore (Collins), passed away on Tuesday, July 13, 2021, in her 88th year. She will be reunited with her beloved husband, Robert Collins (2020); as well as her parents, Gladys and Frank; and brother, Chuck (Lorraine). Marlyn was born in Toronto and as an adult, worked at the St. Thomas Psychiatric Hospital. She loved being with her friends, family, hiking and travelling. She will be missed by her children, Allen, Steven (Margie), Cathy, Wendy, Tracy (late Joe), and Nancy. Marlyn will also be deeply missed by grandchildren, Wiley, Bailey, Jessica, Rachel, Sheldon, Zachary, Carter, and Jen; great-grandson, Benjamin; and godchildren, Tanya (Jennifer), Anthony (Jennifer), and their boys, Aidan and Liam. A Celebration of Life will be held at a later date. Online condolences may be shared by visiting ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=reta-lambert&pid=199576577", "deceased_name": "RETA LAMBERT", "year_born_died": null, "message": "\n      LAMBERT, RETA Passed away on Thursday, July 22, 2021. Predeceased by her parents, Chester and Euphamie Lambert, and her brother Carson (Oscar). She will be missed by her daughter Bonnie (Chris) Fokkens, granddaughter Stephanie Andrews, great-grandson Joshua Vanderlee, niece Karen (John) Salvucci, and nephew David (Deborah) Lambert and their families as well as friends in Toronto and the surrounding areas. Friend of Bill W. for over 30 years. Reta spent most of her teaching and principal's career with the Peel Board of Education and its predecessors. Cremation has taken place by her request. Online condolences available at ", "published_source": "Published in Toronto Star on Jul. 26, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=cecil-justin-lam&pid=199552974", "deceased_name": "CECIL JUSTIN LAM", "year_born_died": "1957 - 2021", "message": "\n      LAM, CECIL JUSTIN 1957 - 2021 Our beloved brother Cecil Justin, ascended to Heaven, on July 19, 2021. Born Lam Cho Yiu, on December 16, 1957 in Hong Kong, Cecil was a grandson of Hong Kong magnate Lam Hau Tak, founder of the famous Lam Yuen Fong Watch Company. A devout Christian, Cecil was a philosopher, a published poet, an exhibited artist and talented musician. Passionate and larger than life, Cecil was generous and gave joy to many despite a life full of challenges. Cecil had a great sense of humour. On his calling card he listed himself as \"Friend of Architects\". Cecil will be greatly missed by brothers Patrick and Victor (Ann), sisters Carmen (Ricky) and Daisy, nieces Jennifer (husband Jayson, children Theodore and Alexandra) and Jocelyn (Andrew) and all those fortunate enough to have crossed his path.", "published_source": "Published in Toronto Star on Jul. 23, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=gary-alan-kirk&pid=199564063", "deceased_name": "GARY ALAN KIRK", "year_born_died": null, "message": "\n      KIRK, GARY ALAN Gary Alan Kirk, born February 7, 1955 in Southampton, England passed away in Toronto on July 16, 2021. Gary immigrated to Canada with his brother Greg Kirk, father, Alan Kirk, and step-mother Lesley Fulton Oglesby in 1972, settling in Pickering, Ontario. He went to Victoria Park high school and grew up in the car business, working at his father's antique car restoration company, before going onto a successful career in the automotive industry himself, managing various body shops and dealerships across the Greater Toronto Area. Gary was known as a colourful storyteller and amazing joke teller. He was kind, generous and enjoyed making people smile. He was an unforgettable, loveable character with a sly wit who left a lasting impression on everyone he met. He had a special gift of making people laugh like nobody else. He was an amazing guitar player and enjoyed good times with friends and family. His love for Britain never wavered, despite his years away from England. He passed away peacefully with his favourite band, the Beatles, playing in the background as his wife held his hand by his bedside. Gary leaves behind his wife, Sharona Kirk and his step- sons, Lloyd and Perry, brother Greg Kirk, sister-in-law, Amanda Squires, step-mother, Lesley Fulton Oglesby, and sister, Victoria Kirk, and niece and nephew Connor and Isabella Smith. He will be sadly missed. The family wishes to thank the palliative care and the GI team at Mount Sinai hospital 14 North. If you would like to support a cause in honour of Gary, please donate to the Crohn's and Colitis Foundation or the Alzheimer Society in his name.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=gabriela-kennedy-gaby&pid=199564058", "deceased_name": "GABRIELA (GABY) KENNEDY", "year_born_died": "1956 - 2021", "message": "\n      KENNEDY, GABRIELA (GABY) 1956 - 2021 It is with sadness that after a long illness we announce that Gaby passed peacefully on June 26, 2021. Beloved wife of Steve. Loving mother to Matthew (predeceased) (Lindsay), Lauren and Nicole. Grammy to granddaughter Ella. Daughter to Joe (predeceased) and Theresa Weinhofer. Sister to Heidy Crichton (Derek - predeceased). Gaby was happiest when surrounded by family and friends and particularly so when at the cottage on Gull Lake, Haliburton. We will all miss you Gaby. Take care of Matthew. A private celebration of life will be held per Gaby's wishes. A special thank you to the wonderful staff at the Ross Memorial Hospital. \"LOVE YOU FOREVER, LIKE YOU FOR ALWAYS - SEE YOU AGAIN\"", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=donald-raymond-hewitt&pid=199564083", "deceased_name": "DONALD RAYMOND HEWITT", "year_born_died": "1935 - 2021", "message": "\n      HEWITT, DONALD RAYMOND October 21, 1935 – July 20, 2021 Don will be greatly missed by his wife Francine and children Steven, Michael and Debbie, his grandsons Bryan and Nathan and great-grandchildren Tanisha, Jonathan, Amaya and Malachi. Don enjoyed a career in the Insurance Industry retiring as V.P. of The Facility Association. He was an active member of St. Martin's Anglican Church, Bay Ridges. As a member of Civitan International, Don dedicated himself to the Agincourt Civitan Hockey League, Special Olympics and served as Governor and International Director. His greatest joy were his days volunteering with Durham Community Care playing the piano and interacting with the people there. Don was also an advocate for Water First Education and Training Inc. Many of Don's watercolour paintings hang on walls across Canada. He was loved by many and will be greatly missed. A memorial service will be scheduled through the Highland Funeral Home – Scarborough. Please visit their website for more information: ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=carlton-grant&pid=199564061", "deceased_name": "CARLTON GRANT", "year_born_died": null, "message": "\n      GRANT, CARLTON Carlton passed away peacefully, at the age of 82, on July 19, 2021. Born Carlton George Grant, he was the second of 3 sons born to Enid Louise Thompson. Robert (Son), Carlton and Joe. Predeceased by his wife Beverly (nee Schloss); proud father of 3 sons Omar, Etienne and Chet (Alexandra) and only grandson Cezaro. Carlton retired from Bell Canada after more than 35 years of service. He enjoyed spending time with friends at the Commonwealth Cricket Club and doing community service with his Brethren at Eureka Lodge No. 20. A service in celebration of his life will be held on Saturday, July 31st at 1:30 p.m. at Chapel Ridge Funeral Home, 8911 Woodbine Ave. in Markham. Visitation will take place on Friday, July 30th from 7-9 p.m. Online condolences can be left for the family at ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=kevin-robert-glass&pid=199564040", "deceased_name": "KEVIN ROBERT GLASS", "year_born_died": null, "message": "\n      GLASS, KEVIN ROBERT August 26, 1955 - July 8, 2021 Of Scarborough, ON. Son of the late Samuel (aka Sandy) Glass and Anne Cronin; beloved brother of Wendy, Valerie, Allison and Timothy. Ex-husband of Darlene Glass. Loving father of Sarah Rae Glass (Robin Logan) and Nathaniel Lee Glass; and wonderful grandfather to Elijah, Myrah and Rowan. Kevin passed away suddenly in his home on Thursday, July 8, 2021. He is loved beyond words and will be forever missed by the family and friends he left behind. The family will keep his memory alive through his children and grandchildren, and keep him in our hearts. Kevin's favourite saying to his children, \"I love you forever and ever, no matter what happens.\"", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=joyce-ruth-gault&pid=199564080", "deceased_name": "JOYCE RUTH GAULT", "year_born_died": "1927 - 2021", "message": "\n      GAULT, JOYCE RUTH Born February 20, 1927, in Toronto. Died July 21, 2021 at Toronto Western Hospital after a brief stay at care home Kensington Gardens, at the age of 94 and 1/2. \"Old Aunt Joyce\", as she referred to herself to myself and my husband Robert, her nephew, her only remaining family, simply wore out. She survived the worst of this pandemic-of-a-century, in one of the most fragile of old bodies to succumb to the more familiar complications of old age. Joyce was raised in a Toronto semi-detached home along with her 2 brothers, Gordon and David, off the Danforth by her parents William and Ethel. As a young woman, her aspiration was to travel, which she did, although not extensively due to the constraints of her finances. Her party-girl drink was a Rum and Coke. She dated a number of young men, \"Kenny\", the \"Momma's boy\", whose father told him to marry Joyce because he wanted a grandson. Joyce retorted, \"That's no reason to get married\", so it ended. The big heartbreak was \"Ray\", a Brit, a relationship of \"3 years and 9 months.\" They would go to the Royal York Hotel, dance the Jitterbug with everyone clapping. He left, without telling her, to return to the UK after having an accident, losing his job, and losing his brother. It took her 2 years to get over him. She worked her entire career, at least 45 years, at Gravure-craft, a business generations-old producing the printer materials used at funeral homes (obviously a business with staying power). In retirement, she thoroughly enjoyed the annual Old Mill Christmas dinners hosted by the business, right up until the pandemic put a stop to indoor dining. Joyce lived on her own, having never married or having children, for 48 years in a modest apartment on Jane Street, right at the bus stop near Baby Point. This convenience afforded her the opportunity to easily use the TTC to travel all over the city, which she did regularly with enthusiasm, to shop for her family and friends, a beloved activity. Joyce would go from one end of the city to the other, by train, streetcar, LRT, and bus, navigating it all with her walker up until 8 months ago, when frailty took over. She would curse the unexpected closures of TTC elevators, leaving her stranded at one stop or another, relying on the kindness of Torontonians to assist her in getting up or down the stairs. A cherished activity for Joyce was seeing and enjoying her friends, sharing meals and the stores of all the goings-on in all their lives. She loved classical music, her Herb Alpert LP, the colour blue, kitty cats, travel magazines, crossword puzzles and dining out with her friends. She shunned television after it went digital and her existing TV wouldn't work, refusing a modern one. She never really liked TV anyway. Joyce was inspired by the popular Hallmark card company, 'Keep your heart brave and your imagination wild.' 'The real voyage of discovery consists not in seeking new landscapes, but in having new eyes.' As per Joyce's wishes, there will be no service. A donation to the Scott Mission would be her wish.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=ronald-john-garlick&pid=199564086", "deceased_name": "RONALD JOHN GARLICK", "year_born_died": "1933 - 2021", "message": "\n      GARLICK, P.Eng, RONALD JOHN May 15, 1933 – July 21, 2021 Ron passed away peacefully at Southlake Hospital with family by his side. Ron was predeceased by his wife Marilyn (2016). Ron is survived by nieces, nephews, grandnieces and grandnephews. Also missing Ron are Muffin, Misty, Garfield, Colby and Tami. Ron is lovingly remembered by his friend Margaret Hullin and family from Ottawa. Ron was especially close to Kim and husband Richard, unofficial grounds keepers. A visitation will be held at the O'Neill Funeral Home, 6324 Main Street, Stouffville on Sunday, July 25th from 2-4 and 6-8 p.m. A private family service will be held at a later time. A celebration of life will take place at Ron's home (Terra Lane) on Monday, July 26th from 2:30-5:00 p.m.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=michael-franey-mike&pid=199546027", "deceased_name": "MICHAEL (MIKE) FRANEY", "year_born_died": "1930 - 2021", "message": "\n      FRANEY, MICHAEL (MIKE) July 1, 1930, to July 21, 2021 After a short illness, Michael peacefully passed away on July 21, 2021, at Michael Garron Hospital. He was predeceased by his first wife, Phoebe (1971) and his second wife, Gabrielle (2020). Mike was born on July 1, 1930, to Denis Franey and Mary Thompson, in Rathnew, County Wicklow, Ireland. He was one of six children. Always a proud Irishman. In his early teens, Mike left Ireland and his family to work in England as part of the postwar reconstruction. On November 24, 1953, he then left Liverpool, England, and travelled to Canada by ship. After arriving in St. John, New Brunswick, he made his way to Toronto to work in the heavy construction industry. It is here he met his wife, Alfreda (Phoebe) Boone. Their home on Browning was an open door to anyone looking to start a new life in Toronto; as well as the Hub for family and friends from Bell Island, Newfoundland Together they raised their four children until her untimely death in 1971, at the young age of 40. After many years working in the heavy construction industry as a proud member of LiUNA Local 183, Mike retired at the age of 55 to start a new venture in the east end of Toronto. He and a fellow Irishman opened a working man's bar on the Danforth called \"The Pride of Erin\". It was here he met Gabrielle Healy from Cork City, Ireland, whom he married and spent many happy years enjoying the cottage at Curtis Point, Rice Lake. From the day he arrived in Toronto, Mike was a diehard Montreal Canadiens fan and took great pleasure watching them beat the Toronto Maple Leafs. He also enjoyed watching NFL Football and was a loyal Tom Brady fan even when he left New England. When asked, he would demonstrate Tom's unique passing style in slow motion, with great delight. Left to miss him are his children and their spouses: Michael (JoAnne), Joan (Brian Everingham), Sean (Theresa), Dennis (Connie), his loving grandchildren, Brandon, Tyler, Patrick (Andrea Belshaw), Catherine (James Spencer), Michael, Valerie and Kyle. His step-grandchildren, Jeff (Emmy), Zach (Jenna) and great-grandson, Zach Jr Everingham, and all his many nieces and nephews in Ireland, Newfoundland, Ontario and Alberta. Visitation will be held at the Heritage Funeral Centre, 50 Overlea Boulevard, Toronto, on Friday, July 23rd, from 5:00 – 8:00 p.m. The funeral service will be held in the funeral home chapel on Saturday, July 24th, at 11:00 a.m. Interment to follow at Holy Cross Catholic Cemetery. The funeral will also be available to view through live stream. Due to the current COVID-19 protocols, the funeral home kindly asks that all guests register to attend the services. Please see ", "published_source": "Published in Toronto Star on Jul. 22, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=zeno-george-fernandes&pid=199513086", "deceased_name": "ZENO GEORGE FERNANDES", "year_born_died": "1923 - 2021", "message": "\n      FERNANDES, ZENO GEORGE March 31, 1923 – July 16, 2021 Passed peacefully at home in his 99th year. Beloved husband of Norma (nee DeSouza) for 72 years. Loving father of Avé (Randy), Denise (Rick) and Simone (Chris). Adored Papa of David (Renée), Alicia, Erin (Anthony), Drew (Angela), Ariana and Alessia. Proud Great-Papa of Michael. Born in Georgetown, British Guiana, Zeno was employed as an overseer at LBI Sugar Estate. Coming to Canada in 1951 he had a long and successful career as a Supervisor of Assessment at the Metropolitan Toronto Separate School Board. Zeno was the last survivor of his siblings, Stella, Joe, Dolly, Mary, Al, Victor and Olive and dear brother-in-law of Doreen (Jack), Mary (Doug), Adriana (Paul) and David (Barbara). Special thanks to Anna at the Toronto East LHIN and the PSW's from Spectrum Health Care, particularly, Ashley (Asnakech) for her dedication and care for Dad over the past year. In lieu of flowers, contributions to Parkinson Canada or the charity of your choice would be appreciated. Due to COVID-19 restrictions, the family has asked that only those invited attend and everyone else may join via Livestream. Click Livestream Link Below for the visitation and service on Friday, July 23, 2021 at 10:15 a.m. ", "published_source": "Published in Toronto Star on Jul. 21, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=mary-dal-ben&pid=199564100", "deceased_name": "Mary DAL BEN", "year_born_died": null, "message": "\n      DAL BEN, Mary (nee DI GIRONIMO) Mary lived a faith-filled life of integrity, kindness and class. She came to rest at Kipling Acres in this, her 92nd year of life. Mary has been happily reunited with Virgilio her husband of 54 years. She is survived by her daughters Patricia (Zdravko) and Katia (Paolo) and her beloved grandchildren Rachael, Massimiliano and Alexander. She will be remembered for her strength, wisdom and unwavering love of her family. She took great pride in celebrating the many milestones of her brothers, sisters, nieces, nephews and friends. Baking cookies for days before a shower and making sure all the outfits were sewn, pressed and ready. Who could forget her exuberance and authentic joy? 'Viva la sposa!' she would exclaim. Dancing until the end of every festa. Her 'casual' attire consisted of a pencil skirt, button down sweater, heels and nylons-even at Earl Rowe Park! Her younger days were spent working at Simpsons-Sears, Tip Top Tailors, driving her Cadillac and dancing the nights away. Once Mary found her true love in Virgilio and they had children, she devoted all she had to them. She was an exceptional soul who focused her life on loving well! She was young at heart and full of goodness, kindness and joy. Loved, Missed, Remembered! 9:30 a.m. St. Clare of Assisi Roman Catholic Church, Woodbridge, July 24, 2021. Please consider a donation to the Alzheimer Society of Canada. ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=james-albert-dainton&pid=199564044", "deceased_name": "James Albert DAINTON", "year_born_died": "1966 - 2021", "message": "\n      DAINTON, James Albert December 8, 1966 - June 28, 2021 It is with great sadness that we announce that heaven gained another angel with the passing of a beloved son, brother and uncle James Albert Dainton. After a year long battle with cancer, and with family by his side, he passed away peacefully at Andy's House in Port Carling, Ontario on the 28th of June 2021 in his 54th year. He leaves behind his parents Valerie and Leslie Dainton, his brothers Robert (Teresa) and Richard, and his dear sister Kathleen Wheeler. He was a kind and loving soul and was lovingly known as Uncle Jimbo to his nieces and nephew Shauna, Taylor, Tracy, Avrie and Ryan. He was employed by the City of Toronto (Scarborough) as a Arena Attendant for over 33 years. Special thanks to the wonderful staff at Andy's Place. Cremation has already taken place and a celebration of life will be held at a later date. In lieu of flowers, donations would be gladly accepted at the Canadian Cancer Sociey or Andy's House, located at 16 West St., Port Carling, ON P0B 1J0 (", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=maria-fatima-correia&pid=199546020", "deceased_name": "Maria Fatima CORREIA", "year_born_died": null, "message": "\n      CORREIA, Maria Fatima (nee MONIZ) God called Maria peacefully on July 18, 2021 at the age of 83. She was predeceased by her loving husband Joe Correia. Cherished by her dear children, Rui, Joe, Fatima and Maria. Proud grandmother to Amy, Jesse, James, Adam, Amanda and Cody and great-grandmother to Preslynn, Ella, Ethan and Marcus. She will be held dear in the hearts of her family, relatives, and many friends. The visitation will take place at the Cardinal Funeral Home Bathurst Chapel on Thursday, July 22, 2021 4-8 p.m. A Funeral Mass be celebrated at St. Mary's Church on Friday, July 23rd at 9.45 a.m. Entombment to follow at Holy Cross Cemetery.", "published_source": "Published in Toronto Star on Jul. 22, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=lorraine-elizabeth-charbonneau&pid=199564073", "deceased_name": "LORRAINE ELIZABETH CHARBONNEAU", "year_born_died": null, "message": "\n      CHARBONNEAU, LORRAINE ELIZABETH Peacefully at home on Tuesday, July 20, 2021, courageous and delightful until the very end. Lorraine had a 37-year career with CIBC, starting as a clerk at St. Clair and Boon, progressing through branches, legal division and retiring from the Ombudsman's office. Born in Rochester, NY, she carried an American passport, but had a true Canadian heart. Lorraine was a voracious reader, crossword solver, and skilled gardener. She will be dearly missed by Bob, her beloved husband and soulmate for over 37 years. They travelled extensively but were happiest simply being together at home, where they enjoyed their weekly candlelight dinners. Lorraine also leaves behind her cherished brother David Scott, a large extended family, and many close friends. In remembrance, donations may be made to the Temmy Latner Centre or the Royal Ontario Museum.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=joseph-thomas-bradley&pid=199576570", "deceased_name": "JOSEPH THOMAS BRADLEY", "year_born_died": null, "message": "\n      BRADLEY, JOSEPH THOMAS (Retired Staff Sgt. Toronto Metro Police Marine Unit) Peacefully, at Kingston General Hospital, on Wednesday, July 21, 2021, in his 89th year. Beloved husband of the late Ethel Bradley (Muir). Loving father of Scott, Anthony and Susan Elaine. Dear grandfather of Taraney, Natasha and Parissa and great-grandfather of Charlotte and Tristan. Survived by his brother Ted Bradley and sister Kathleen Poland. Friends and relatives are invited to attend a graveside service at Eddystone Cemetery (378 Eddystone Rd., Grafton), on Wednesday, July 28, 2021 at 11:30 a.m. If desired, donations may be made to Northumberland Hills Hospital or charity of your choice. Condolences received at: ", "published_source": "Published in Toronto Star on Jul. 26, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=william-john-beadle&pid=199546024", "deceased_name": "William John BEADLE", "year_born_died": null, "message": "\n      BEADLE, William John Passed away at home with his family by his side on July 20, 2021. Billy! No matter how anyone called him, they had a smile on their face. Bill was a simple man. He loved his family and friends. Enjoyed his food and a good drink. He would make jokes out of the simplest of things. A kind hearted man with a heart of gold. He will be missed by his beloved wife, Rosemary. His most prized treasures were his kids, Earl and Delia and, most of all, his grandchildren, Kaiya and Josephine. His father-in-law, Domenic Amelio, along with Terry, Luciano, Fred and Catia. His nieces and nephews, Steven, Julianne, Alexa, Domenic and Ava, and his brothers, George and Norman, he cherished them all. He adored his relatives, friends and neighbours. He will be forever missed. Bill, you were loved by all. Thank you for all the years we were together, you are my hero. Never did he meet a stranger, they were all friends. I'll meet you at every shoreline I'll listen for you in the wind I'll say 'hello' to every flower And know you'll always be within.", "published_source": "Published in Toronto Star on Jul. 22, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=virginia-bertoia&pid=199503570", "deceased_name": "VIRGINIA BERTOIA", "year_born_died": "1925 - 2021", "message": "\n      BERTOIA, VIRGINIA 1925 – 2021 With heartfelt sadness, our family announces the peaceful passing of Virginia Bertoia, on July 18, 2021, at the age of 96. Born in Azzano Decimo, Italy, to the late Francesco and Maria Somera. She will now be reunited with the love of her life, husband Umberto as well as her beloved daughter, grandson, parents and siblings. Virginia was beloved mother to Steglio (Marisa) and the late Marisa. Dear nonna of Marco (Jennifer), Andrea (Michael), and the late Daniel. Adoring bisnonna of Christian, Claudia, Lucas, and Daniel. Virginia was the last surviving member of her birth family, predeceased by siblings Rodolfo, Francesco, Fioravante, Ruggiero, Regina, Luigia, and Caterina. Virginia was a woman of grace, dignity, and strength. Her home enriched the lives of all the family and friends who entered, she will be deeply missed by all who knew her. Due to the COVID-19 pandemic, a private mass will be held on July 21, 2021 at Holy Cross Catholic Funeral Home in the Chapel of St. Joseph. An entombment will follow at Holy Cross Cemetery. To stream the mass, please visit: ", "published_source": "Published in Toronto Star on Jul. 20, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=denis-bolieau&pid=199552975", "deceased_name": "DENIS BOLIEAU", "year_born_died": null, "message": "\n      BOLIEAU, DENIS It is with heartfelt sadness, our family announces the passing of Denis, on Tuesday, July 20, 2021. He will be deeply missed by his beloved wife of 43 years Virginia, loving son Marc, daughter the late Sophie Boileau and Harley. Funeral arrangements have been entrusted to Catholic Cremation Services. Online condolences may be left for the family at: ", "published_source": "Published in Toronto Star on Jul. 23, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=kenneth-lawrence-cranney-ken-larry&pid=199564088", "deceased_name": "KENNETH LAWRENCE (KEN, LARRY) CRANNEY", "year_born_died": null, "message": "\n      CRANNEY, KENNETH LAWRENCE (KEN, LARRY) Passed away at home very peacefully on Tuesday, July 20, 2021 in his 81st year. Beloved husband of Lee McDonald and the late Jantina (Tina). Cherished father to Ken W. (Ina), Randall (Joanna), Karin, Richard (Adele), Michael (Corrina), Tim, Jay (Allison), Diana (Bill Cooper), Linda (Neil Taylor) and the late Joseph. Will be fondly remembered by Lee's daughters: Christina (Jerry) Fritz and Tara (Troy) Rieder and their families. Devoted Grampa to 20 and great-grandpa to 6. Brother to Janis Almond (Dave), Arthur House (Betsy), Tom House (Helen), Ted House (Diane), Daryl House (Glenda), Beverly House (Linda), Katherine Peters (Wayne) and Kerry Kierstead. Ken will be sadly missed by his extended family and friends and all who knew him. A Memorial Mass will be held at St. Therese Catholic Church, 3800 Courtice Road N., Courtice on Saturday, July 31, 2021 at 11:00 a.m. Relatives and friends are invited to greet the family at 10:00 a.m. and the Rosary will be prayed at 10:30 a.m. with Mass to follow. For those who would like to watch the Mass via live stream, please use the link below. ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=gwenneth-de-rosa-magnan&pid=199564052", "deceased_name": "GWENNETH (MAGNAN) DE ROSA", "year_born_died": "1927 - 2021", "message": "\n      DE ROSA (MAGNAN), GWENNETH (nee ROUSBY) January 2, 1927 – July 11, 2021 We are sad to announce the passing of Gwenneth DeRosa, of a stroke, with Jane and Tom at her side, at the age of 94. Gwenneth was predeceased by her mother Marjorie Rousby (1996), her father, Arthur Edwards-Rousby (1978), and her sister Barbara (2019). In 1948 she married William Magnan and together they raised John (Shirley), Jane (Thomas), and Andrew (Adrienne). After our loving Dad, Bill died unexpectedly in 1987, Mum met George DeRosa, and they married in 1993, beginning their travelling adventures across Canada, and becoming familiar with just about every Tim Hortons along the way. In addition to John, Jane, and Andrew, Gwenneth leaves grandchildren Nicole, Nicholas, and Kate, and great-grandson William (Nicole and Hans). Gwenneth enjoyed music, crossword puzzles, CNN, and television shows about animals, pointing out that they behaved better and were smarter than many humans. Above all, Gwenneth would often say that she felt blessed by family and friends. We would like to thank Southbrook Lodge for their excellent care. Cremation and a private family service have taken place. For those who wish, donations can be made to El Hogar Projects (Canada) on the El Hogar website ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=norman-rees-dean&pid=199494463", "deceased_name": "NORMAN REES DEAN", "year_born_died": null, "message": "\n      DEAN, NORMAN REES Passed away on July 13, 2021, at The Briton House. Loving husband of Joy Dean (nee Durnan) for 63 years. Devoted father of Karen Scattolin (Enio) and Kevin Dean. Best buddy to grandson, Christopher. Brother of Lloyd and the late Desmond and Gloria. In lieu of flowers, a donation to The War Amps or The Star Fresh Air Fund would be appreciated.", "published_source": "Published in Toronto Star from Jul. 19 to Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=ellen-foley&pid=199564076", "deceased_name": "Ellen FOLEY", "year_born_died": null, "message": "\n      FOLEY, Ellen (nee McCUE) Passed away suddenly, on Friday, July 16, 2021, in her 94th year. She was predeceased by her husband Michael, her son John and her daughter Mary Catherine (Hudakoc). Loving mother of Eileen (Eugene Jung) and Agnes (Sandy Schaefer). Ellen was the beloved grandmother of six grandchildren and five great-grandchildren. For more information, please see the Rosar-Morrison Funeral Home and Chapel Obituaries.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=murray-albert-hatt&pid=199564068", "deceased_name": "Murray Albert HATT", "year_born_died": "1930 - 2021", "message": "\n      HATT, Murray Albert September 4, 1930 - July 7, 2021 Simply the best husband, dad and grandpa anyone could ask for. Patient and kind, he will be remembered by Fran, Gary and Judy, Diane and Robert and Lindsay and Ryan. Murray's superpower on earth was his affinity to consume kilos of maple fudge and not gain weight. He was a man who did not believe in sunscreen but, of course, he maintained a great faith in his beloved Toronto Maple Leafs. Together with Fran, he enjoyed the finer things in life and the cleanest house on the planet. A generous, gentle man in all respects with a dry, quiet, unassuming wit and humour, we all love Murray. We are sincerely looking forward to reuniting with him in heaven. As per Murray's wishes, there is no visitation or service.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=john-david-hoover&pid=199564049", "deceased_name": "JOHN DAVID HOOVER", "year_born_died": null, "message": "\n      HOOVER, JOHN DAVID 1935 - 2021 John David Hoover passed away in Collingwood General and Marine Hospital on Saturday, July 17, 2021, after a valiant battle with cancer. He was born in Beeton, Ontario on October 16, 1935 to Wallace and Irene (Sheffield) Hoover (deceased). He is survived by his wife of 61 years Shirley (Cherrington) and sons Timothy (Jamie), Darcy and James (Nancy). Brother to Joan (deceased) Beverly (deceased) and Margaret. Loving grandfather to Travis, Samantha (Brian) Jacklyn, Tyler, Colin, Rhiannon, Marlon, Kyle and Serina. Great-grandfather to Bethany, Georgianna and Roselea. A private family only service was held at Drury Funeral Centre in Alliston, Ontario on Friday, July 23rd. Interment at Beeton Trinity Cemetery. The date for public memorial service will be announced in the coming weeks. Those wishing to send flowers or make a donation to the ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=dorothy-viva-horton&pid=199503573", "deceased_name": "Dorothy Viva HORTON", "year_born_died": "1932 - 2021", "message": "\n      HORTON, Dorothy Viva (nee RYE) October 28, 1932 - July 12, 2021 HORTON (née Rye), Dorothy Viva, 88, of Sherwood Park, Alberta, passed away peacefully, on July 12, 2021, with her four boys surrounding her with love. Dorothy was born in Harvey, Illinois, in 1932 to Freeman and Viva Rye. She moved with her family five years later to Ontario where she developed an amazing work ethic and took on her first job at 11 years of age in an ice cream factory. She received a degree in nursing from the Wellesley School of Nursing in Toronto and went on to be a stewardess at Trans Canada Airlines. While studying, she met the love of her life and best friend, William \"Bill\" Horton. They would marry in 1954. Dorothy and Bill moved west to Alberta in 1955 and lived in Calgary, Camrose and Edmonton. In 1958, Dorothy and Bill moved to Sherwood Park where they raised their four sons and made many lifelong friends. Dorothy was a devoted wife and mother as well as an active member of the community. She was president of the Oil Wives Association, the Sherwood Park Nurses Association as well as a Board member of the University of Alberta Hospital, Alberta Heritage Medical Research Foundation and the Canadian Mental Health Association. She was a proud member of the Maple Wings Association. She also volunteered for many organizations including as a driver for patients to the Cross Cancer Institute. Dorothy worked for Elections Canada as a Chief Returning Officer for several elections. She was elected to the Strathcona County School Board in 1979, then was elected for two terms as a Councillor for Strathcona County and served until 1986. Dorothy devoted her time to raising her sons, encouraging their love of music, and taking them to many hockey practices, games, and tournaments. In 1984, she and Bill bought their beloved property on Lake Okanagan, B.C., where they retired in 1997 and enjoyed time golfing, sailing, playing bridge and making many new friends. Her most precious time there was spent with their children and grandchildren. She and Bill returned to Sherwood Park in 2016. Dorothy will be greatly missed by her children, Bill (Rachelle), Bob (Debb), Doug (Aileen) and Ron (Nancy); grandchildren, Charlotte, Russell, Elizabeth, William, Michael, Ryland (Daniel), Rheid (Kent) and Kielan (Calvin); one great-grandchild, Carsen; brother Al (Joyce), sister Delores and sister-in-law Irene; as well as numerous extended family members and friends. Dorothy was predeceased by Bill, her loving husband of 63 years; her parents Freeman and Viva; her brother William and brother-in-law Don. A Celebration of Dorothy's life will be scheduled in the Fall. A special thanks to the extraordinary care team who looked after her in her final days at the Fort Saskatchewan Community Hospital. Memorial donations may be made to the Salvation Army or to a charity of your choice.", "published_source": "Published in Toronto Star on Jul. 20, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=edith-ellen-huhta&pid=199564102", "deceased_name": "EDITH ELLEN HUHTA", "year_born_died": null, "message": "\n      HUHTA, EDITH ELLEN (nee BLAKEMAN) Peacefully, on Monday, July 19, 2021, at Allendale Long Term Care Home in Milton, Ontario. Edith, beloved wife of the late Leo Felix Huhta. Loving mother of Neil and Jeffrey (Carolyn). Edith was a stay home mother until her youngest son left for university. She then worked as Bookkeeper and Paymaster for Coles Books, and then later at Maclean Hunter publishing and broadcasting company. Edith lost her beloved Leo when he succumbed to Alzheimer's disease at Allendale in 1998. She continued to do volunteer work at the same long term care home and at the Sir John Colburn Senior Centre. Those who knew her enjoyed her positive nature, her selfless attitude, and her love of family. Edith was a very social person who developed many deep friendships over the years.. She was a member of the St. Simon's Anglican Church in Oakville, and a member of the Red Hats women's club. Edith was loved greatly and will be deeply missed by all who knew her. Visitation will be held on Monday, July 26, 2021, at Kopriva Taylor Community Funeral Home, 64 Lakeshore Road West, Oakville (one block East of Kerr Street) from 12 noon until 1 p.m. Funeral Service will take place in the Funeral Home Chapel at 1 p.m. Monday, with interment to follow at Trafalgar Lawn Cemetery. To register to attend the visitation and funeral, and to read her complete obituary, please visit the funeral home website at ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=noreen-wilson-jacka&pid=199564079", "deceased_name": "DR. NOREEN WILSON JACKA", "year_born_died": null, "message": "\n      JACKA, DR. NOREEN WILSON (nee CONNELL) Phd. O.I.S.E., MDiv. Wycliffe College Peacefully, with her husband by her side at St. Michael's Hospital, Toronto, on Tuesday, July 20, 2021, at the age of 80. Noreen Jacka, adored wife of Keith Jacka. Loving mother of Robert Jacka, Richard (Andrea) Jacka and Shawn Jacka. Loved grandmother of Megan, Benjamin, Noah, Cameron and Grace and by her great-grandson Marshall. Predeceased by her brother Brian Connell. Noreen provided leadership in the Christian Women's Club in Orillia, Women Alive in Ontario and Ladies Bible Study at Church in the City in Toronto. The family will receive relatives and friends at the Doolittle Chapel of Carson Funeral Homes, 54 Coldwater St. E., Orillia, 705-326-3595, on Wednesday, July 28, 2021 from 2 p.m. until time of funeral service at 3 p.m. The funeral service will be livestreamed on The Carson Funeral Home Channel on ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=tony-jocko&pid=199564065", "deceased_name": "TONY JOCKO", "year_born_died": "1952 - 2021", "message": "\n      JOCKO, TONY December 21, 1952 - July 3, 2021 Celebration of Life In loving memory of Tony Jocko We will be gathering to share our memories and stories of our adventures with Tony. The celebration will be held at the Anishinabek Nation Head Office, 1 Migizii Miikan, Hwy. 17 West, North Bay, Ontario, at 1 p.m., July 31, 2021.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=christos-kachavos&pid=199576575", "deceased_name": "CHRISTOS KACHAVOS", "year_born_died": null, "message": "\n      KACHAVOS, CHRISTOS It is with great sadness that we share the news of the loss of Christos Kachavos, 87 years young. He was a devoted husband, father, and grandfather. Chris was a man with strong convictions and unfaltering faith who was active in his church community. He has reunited with his late wife of 36 years and will be remembered and cherished by his remaining brother, children, and grandchildren. He remains in our hearts, not to be forgotten.", "published_source": "Published in Toronto Star on Jul. 26, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=leila-ann-lavery&pid=199564098", "deceased_name": "Leila Ann LAVERY", "year_born_died": "1931 - 2021", "message": "\n      LAVERY, Leila Ann (nee WAKLEY) Leila died peacefully on July 20, 2021 at Scarborough Birchmount Hospital, Toronto. She struggled for the past five years from dementia and fractures, and the family appreciates all the care and support she received from a number of wonderful staff at all the health and care facilities. She was born July 23, 1931 in Rosseau, Ontario, the cherished daughter of Freta Mae Wakley (nee Grenkie) and Thomas William Wakley, and passed away just 3 days short of 90 years. Lifelong Torontonians, Leila and her much loved husband Glenn began going steady when she was in grade 9 at Lawrence Park Collegiate Institute and they were married on July 24, 1953. Saturday will be their 68th wedding anniversary. She was dearly loved by children Janice Lavery (Dave Hubbarde) and Rob Lavery (Robert Amaral). Leila was predeceased by brother Ronald Wakley and his wife Shirley; survived by niece Elaine Matheson, cousins Ed and Doug Grenkie, brother-in-law Doug Lavery, their families and many other relatives. Leila began her work life as a teacher at Armour Heights Public School. Later in life, she continued with her second career at Ogden Funeral Home, as well as her volunteer service at Scarborough Birchmount Hospital. Lee's faith was very important to her and when she and Glenn started their family, she became a very active member of Knox United Church, Agincourt serving on many committees. During her cottage years at Chandos Lake, she also joined the congregation at Apsley United Church. Her friendships and family connections in Canada and abroad were maintained carefully and with love. She was devoted to maintaining contact with many circles of friends for decades, beginning with her sorority from Lawrence Park CI, friends from Farmerette camp, her longtime membership in UofT's Engineers' Wives, and her Honoury Lifetime Membership in UCW (United Church Women), a group that was the source of many close friendships over the years. She also cherished her role as 'neighbour-Lee' to the LaRush family. Her community spirit and love of family will be missed by all who knew her and called her a friend. A private family service will be held at a later date. Condolences may be expressed to the family through the funeral home webpage ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=ruth-norene-mallett&pid=199513085", "deceased_name": "RUTH NORENE MALLETT", "year_born_died": "1938 - 2021", "message": "\n      MALLETT, RUTH NORENE 1938 - 2021 It's with great sadness that the family of Ruth Norene Mallett announces her passing, on Sunday, June 27, 2021, at the golden age of 83. Ruth will be fondly remembered by her loving family members and friends, and the cherished memories of Ruth will be greater than the sorrow and pain felt today. Ruth was well-known for her great sense of creativity, her charitable spirit of giving, quick wit, love of cooking and spending time with extended love ones, and so much more. She will be deeply missed by her many sisters, brothers, nieces, nephews, cousins, friends and neighbours. Visitation and funeral service will be held to honour Ruth at Ogden Funeral Home, 4164 Sheppard Ave. E., on Friday, July 23rd from 6-8 p.m. and Saturday, July 24th at 1:00 p.m. for immediate family and invited guests. Family and friends may send condolences to ", "published_source": "Published in Toronto Star on Jul. 21, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=norma-manson&pid=199513089", "deceased_name": "Norma MANSON", "year_born_died": "1934 - 2021", "message": "\n      MANSON, Norma (nee HAMES) October 5, 1934 - July 18, 2021 Survived by her beloved husband Ron. Loving mother of Al and his wife Dawn, and Janice and her husband Bill. Caring Grandma to Rebecca, Katherine and Billy. Cherished sister of Marjorie and Jean. Norma loved music. She entertained many on television and stage with sisters Marjorie and Jean, The Hames Sisters. She continued to write and record music until she was 85. Following her singing career, she worked as an educational assistant for the TDSB. She spent countless hours volunteering at the church Out of the Cold program and was known at Lyndhurst Hospital as The Pie Lady who baked pies that she would feed to many patients. One of her greatest joys was chatting with people and learning their life stories. Thank you to Sunrise of Aurora and Southlake Regional Health Centre for their wonderful care. Visitation and Funeral Service will be held at Taylor Funeral Home, 524 Davis Drive, Newmarket, on Thursday, July 22, 2021. Visitation will be held from 11:00-11:45 a.m. and 12:00-12:45 p.m. Funeral Service will take place at 2:00 p.m. Due to the current restrictions, attendance is limited. Please call Taylor Funeral Home, 905-898-2100, between 9:00 a.m.-5:00 p.m. to RSVP. In lieu of flowers, donations may be made to the Alzheimer Society or the ", "published_source": "Published in Toronto Star on Jul. 21, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=thomas-willam-pacey&pid=199552971", "deceased_name": "THOMAS WILLAM PACEY", "year_born_died": null, "message": "\n      PACEY, THOMAS WILLAM Industrial Designer Extraordinaire June 24. 1940 - July 12 2021 You have gone down to the sea again, to the vagrant gypsy life, To the gull's way and the whale's way where the wind's like a whetted knife; And all you ask is a merry yarn from a laughing fellow-rover, And quiet sleep and a sweet dream when the long journey's over. From Sea Fever by John Masefield You touched our lives and hearts more profoundly than you could ever know. Deeply missed Never forgotten Loved forever Elly, family and friends.", "published_source": "Published in Toronto Star on Jul. 23, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=wanda-jean-perdue&pid=199576576", "deceased_name": "Wanda-Jean PERDUE", "year_born_died": null, "message": "\n      PERDUE, Wanda-Jean (nee MILLAR) November 1, 1951 – July 23, 2021 It is with great sadness that we announce the passing of Wanda-Jean Millar Perdue. Wanda passed away on Friday, July 23, 2021. Wanda is survived by her adoring husband and best friend John Perdue, survived by her loving children Kimberly and John, as well as her children-in-law, Ashley Carder and Brooke McGale. Recently, she had become Nana to Paige Evelyn. Although, the time Wanda and Paige had together was far too short, the time they did have brought Wanda immense joy. Paige will never know the joy and happiness she brought to her Nana. Wanda is survived by her siblings Lee-ann Smith, Sharron Day, and Robert Millar, as well as her sister-in-law and brothers-in-law Ann (Gord) Moore and Richard Perdue. Wanda had nieces and nephews whom she loved dearly. She was predeceased by her parents Robert and Rita Millar, of North Bay. Wanda will be remembered for her wonderful sense of humor, her unconditional love not only for her family but for her numerous friends whom she thought of as part of her family. She was an active member in the congregation of St. John's Anglican Church in Ancaster, Ontario, as a sides person, reader, or assisting in the kitchen. Wanda had many achievements through out her lifetime, one of them being the receiver of the 2016 Order of Niagara. Due to COVID–19, further details of the visitation, service and inurnment of Wanda Perdue will be provided on the St. John's church website (", "published_source": "Published in Toronto Star on Jul. 26, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=georgina-mary-prentice&pid=199564053", "deceased_name": "GEORGINA MARY PRENTICE", "year_born_died": "1921 - 2021", "message": "\n      PRENTICE, GEORGINA MARY (nee EDMONDS) May 25, 1921 – July 15, 2021 Peacefully passed away, on July 15, 2021, at the age of 100, at the Belmont Long Term Care Facility in Belleville, Ontario. Georgina was born on May 25, 1921 in Toronto, Ontario, to Isabelle and Star Edmonds. Beloved Wife of the predeceased Joe Prentice and loving Mother of predeceased Judy, David (Debbie), Joanne (Howie), John (Evonne) and loving Nanny to Deanna (Dave), Rob (Alison), Greg (Zoe), Michael (Jessica), Peter (Sharla), Kevin (Cortney), Sean and 17 great-grandchildren. Georgina had a very full and active life. She loved to travel, visit with family and friends, play bridge, dine out and spend time at the cottage. A private memorial service will be held at a later date. The family wishes to send a special thank you to the staff at Belmont Long Term Care Facility for their care and compassion.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=william-a-silvera-bill&pid=199552972", "deceased_name": "WILLIAM A. (BILL) SILVERA", "year_born_died": "1928 - 2021", "message": "\n      SILVERA, WILLIAM A. (BILL) May 31, 1928 – July 19, 2021 Peacefully, with his loving wife by his side, on Monday, July 19, 2021, at Afton Park Place, William \"Bill\" Arthur Silvera passed away at the age of 93. Born and raised in Toronto, Bill attended Riverdale Collegiate where he graduated in 1947 with a Senior Honours Matriculation. His interest in photography took him into the field of commercial art where he worked in companies; Reliance Engravers, Ken Bell, TDF Artists, and Cooper and Beatty. In 1958 Bill began his sales career with Clive Peacock Art Studios, and in 1972 started his own AdPad Studios along with his 2 partners Jim Weekes and Jim Prince. In 1986 they closed the business when Jim Prince retired. Bill moved to Peterborough and ran a studio until 1992 when he retired. Bill was always involved in sports activities. From 1955 until 1967 he was active in the motorsport field as a rally navigator, running in the Canadian Winter Rally 10 times and the Shell 4000 6 times. In the years 1959, '60, '61 he was three-time winner of the Canadian Rally Championship and the Fidler Trophy that went with it. Bonnie and Bill's interest in ballroom dancing earned them Bronze, Silver, and Gold Level Awards. Predeceased by his parents Ialeen and John, and his granddaughter Kelly. Bill is survived by his beloved wife and best friend, Bonnie, and three children by a previous marriage, Karen (Ted Baker), Jill Baranowski (Tim), and Peter (Erica). Cherished grandfather of Michael Blakey, Stephen, Daniel, Thomas, and Victoria Silvera. Loved great-grandfather of Aubreanna, and Cameron. The family will welcome visitors at Smith Funeral Home, 1576 London Line, Sarnia, on Tuesday, July 27, 2021 from 11:00 a.m. until 12:00 p.m. Due to COVID restrictions, those who wish to attend must RSVP with a time to attend the visitation: ", "published_source": "Published in Toronto Star on Jul. 23, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=maureen-spero&pid=199564078", "deceased_name": "MAUREEN SPERO", "year_born_died": "1969 - 2021", "message": "\n      SPERO, MAUREEN August 27, 1969 - July 14, 2021 Maureen, affectionately known as Moe to her family and friends, passed away unexpectedly on Lake Rousseau, near her cottage, in a place that brought her incredible peace and happiness. Born in Sarnia, daughter to Rosella Spero and Stephen Spero (deceased), she is survived by her children Heather, Lucas and Jackson Wiley. She will be missed by her sisters Laura Spero, Katherine Spero, Lynda Kiriakakos (husband Peter) and her twin sister Heather Angelo (husband Dustin). From the day her three beautiful babies were born, Moe was first and foremost a mother. She was a natural mom with her gentle spirit and calming demeanour. As the kids grew up, Moe participated in all their activities. She volunteered and coached both Luke and Jackson's basketball, flag football and soccer teams for a number of years (she notoriously had to YouTube soccer drills as she had NO idea what she was doing). She led Heather's Girl Scout troop and helped coach her elementary school's cross-country team. She never missed a hockey game of the boys or any regatta of Luke's no matter what city it was in. As the kids grew up, Moe was focused on being close to them at all times. Heather and Luke lived out of town and she would drop everything when they returned home for a weekend. She never missed the opportunity to cook and sit down to dinner with Jackson during his busy last year of high school. Her unconditional love shone bright and they in turn are three of the most loving and selfless young adults. Being a mom was pure joy to her. It was never a duty to Maureen, it was pure bliss and she had so much fun being a part of their lives in every aspect. A natural in sports, Moe did everything with passion and her characteristic enthusiasm and joy. She was a Provincial Champion in gymnastics, a Western University Varsity Basketball player and a two-time Ironwoman. She loved her time on the tennis courts and had just decided to get out on the golf course. But above all, she was the (self-proclaimed) family ping pong champ and would play for hours with her kids. With her compassion and gentle nature, Moe was an exceptional teacher and personal trainer. She just recently finished her diploma for Addictions Counseling and was intent on focusing her efforts on kids in distress and helping them with coping skills. Moe was charming, magnetic and could light up a room with her infectious smile and sense of humour. She was always up for some adventure/fun and was innately silly. She loved her music and would often start dancing wherever and whenever and within moments, her kids would fall into sync. Heather, Luke and Jackson were all too familiar with their Mom's (robotic) moves and spontaneity. Wherever she went, her positive spirit and energy drew people to her, while her thoughtfulness and caring nature kept her in their hearts forever. She had the quickest wit on earth and truly loved everyone in her life. Moe was a loyal friend who loved unconditionally. She was so beautiful inside and out. Maureen had the Grace of an Angel and will remain with us forever in spirit. She is peacefully reunited with her father, Stephen Spero, her friend Janet, and her beloved pooches, Bella, Gracie, and Molly. A private funeral service took place on Friday, July 23rd. The family will be hosting a Celebration of Life at a future date. In lieu of flowers, and on behalf of Heather, Luke and Jackson, donations to the Legacy of Hope Foundation (LHR), a national Indigenous charitable organization would be appreciated. The LHF supports the ongoing healing process of Residential School Survivors, and their families and seeks their input on projects that honour them. https://legacyofhope.ca/english/get-involved/donate/ Online condolences may be made at ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=gerald-e-thomas&pid=199503569", "deceased_name": "Gerald E. THOMAS", "year_born_died": "1930 - 2021", "message": "\n      THOMAS, Gerald E. 1930 – 2021 Passed away peacefully on July 16, 2021. Beloved husband of 60 years to Jean. Much loved father of Karen, Greg, Michael and wife Andrea, and Andrea. Proudest Papa of Joshua and Erika, Lucas, and Olivia. Son of the late Violet and David. Brother of Keith (deceased), Milton and Diana. A private family service will be held at the Low & Low Funeral Home, 23 Main Street South, Box 388, Uxbridge L9P 1M8 (905-852- 3073). In lieu of flowers, a donation to the Uxbridge Cottage Hospital Foundation would be appreciated by the family. Online condolences may be made at ", "published_source": "Published in Toronto Star on Jul. 20, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=velta-tomsons&pid=199564104", "deceased_name": "VELTA TOMSONS", "year_born_died": null, "message": "\n      TOMSONS, VELTA In her 94th year, our dear aunt Velta Tomsons, passed away July 14, 2021, in Toronto. Her zeal for life and enthusiastic nature was wonderful to behold. Both an accomplished artist and an athlete, Velta attended the Banff school of the arts for painting and threw shot put in many Master's Games. On weekends and holidays, Velta spent her time at Whispering Pines, her beloved cottage in Wasaga Beach. Many gatherings were enjoyed there and cherished memories made with family and friends. \"Lust?ga dz?vošana\" was her motto. We will miss her greatly. Fondly remembered by Ed, Arnold, Ingrida, Erik and families as well as relatives and friends in Canada, United States and Latvia. Services for Velta will be held at the Rosar-Morrison Funeral Home, 467 Sherbourne St., Toronto, on Monday, July 26, 2021. Public visitation from 10 to 11 a.m. Her Funeral Service will be at 11 a.m. with a limited capacity. Private cremation to follow.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=michael-ralph-torney-smiley&pid=199564082", "deceased_name": "MICHAEL RALPH \"SMILEY\" TORNEY", "year_born_died": null, "message": "\n      TORNEY, MICHAEL RALPH \"SMILEY\" With heavy hearts we share the passing of Michael Ralph Torney 'Smiley.' Mike passed away on July 13, 2021 at the age of 53. He is survived by loving family and friends who cared deeply for him including his wife, Korene, and young daughters Lauren and Julia; sisters Louisa Gamoyda (Steve), Beth Wood; brother Allan Torney (Debbie); his wife's family; and many nieces, nephews, aunts, uncles and 2 grandmothers. He was predeceased by his parents Ruth and Ralph Torney. Mike loved to explore and his career took him throughout the Americas from NWT and Alaska to Ecuador and Brazil) where he always joined in local traditions (AK Sourtoe, NL screech, Brazilian caipirinha). Mike will forever be remembered for his bright smile, hearty laugh, warm heart, and his ability to make and sustain friendships wherever he went. Mike was unique, his heart had room for all of us, and we will miss him beyond words. In September we will hold two celebrations of life (Victoria, BC and Scarborough, ON). We'll post celebration details at ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=christos-vlassopoulos&pid=199546022", "deceased_name": "CHRISTOS VLASSOPOULOS", "year_born_died": null, "message": "\n      VLASSOPOULOS, CHRISTOS It is with great sadness that we announce the passing of Christos Vlassopoulos on Tuesday, July 20, 2021 in his 89th year. Christos is survived by his loving wife Georgia, his children: Helen and her husband Gordon, Gina and her husband Shawn and his grandchildren: Dylan, Griffen, Chloe and Luke. He will be missed and eternally loved by us all.", "published_source": "Published in Toronto Star on Jul. 22, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=susan-p-wallace&pid=199513088", "deceased_name": "Susan P. WALLACE", "year_born_died": null, "message": "\n      WALLACE, Susan P. On Sunday morning, July 18, 2021, Susan Pamela Wallace died unexpectedly at St. Michael's Hospital in Toronto from heart failure. Susan was born on December 17, 1941 in London, Ontario to parents John and Lolita Gunn. Susan retired 25 years ago from a rich career as an educator in the Peel Board of Education, the University of Toronto, and as an award-winning author of many books for children. From that time on, she travelled the world living at times in Costa Rica, Mexico, South Africa, and for the longest time in Mendoza, Argentina. She was full of life and enjoyed the company of good friends and family. All that knew her can attest she was a beautiful, kind, funny, giving, and highly intelligent, articulate woman. Susan leaves behind her daughter Tracy Garner, Tracy's partner Peter, her son Douglas Brian, daughter-in-law Isobel, and granddaughters Georgia and Ivy to whom she devoted herself. She was very much loved and will be missed greatly. She has left us too soon and had so much more life to enjoy and so much of herself to give.", "published_source": "Published in Toronto Star on Jul. 21, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=eileen-doris-adamson&pid=199564095", "deceased_name": "Eileen Doris ADAMSON", "year_born_died": "1926 - 2021", "message": "\n      ADAMSON, Eileen Doris (nee HELLARD) On July 21, 2021, in her 95th year. Survived by her devoted husband and life companion, George, having recently marked their 74th wedding anniversary. Also survived by her brother, Russell (Kay), and brothers-in-law, Bill (Marlene) and Duncan. Daughter of Walter and Bertha Hellard, sister to Irv, Vi, Frank and Marjorie, all previously deceased. Born October 5, 1926, on her father's birthday, Eileen was a Toronto girl, born and raised. She leaves behind an extensive family who will miss her dearly: loving mother to twins, David (Len) and Donald, Nancy (Fred) and Cathy (Paul), proud grandmother to Ryan (Shelli), Kourtney, Joel (Alyssa), Jake (Siobhan), Jessica, Sarah (Anthony), Hayley (Cody) and Matt, great-grandmother to Charlie, Chase, Ari, Miles, Andrew, Maverick, Syve, Hank and Juniper. Leeny/Leeny Bean had the opportunity to travel extensively and enjoyed many cruises around the world. She was active all her life, an avid walker, a fan of exercising. She enjoyed her home and loved her family. She also volunteered at hospitals, libraries, church groups and girls' clubs. Leeny will be remembered for her devotion to her family, her kind spirit and her gentle ways. She will be sorely missed by we who remain. We will treasure our memories of her forever. We would like to extend our heartfelt thanks to the staff and healthcare workers at Amica Dundas, whose care of Eileen was unwaveringly kind and respectful. Eileen was known to those close to her for little quips and retorts. In her tribute to the staff, we feel certain that she would have said, 'God bless 'em!' Cremation has taken place. For condolences, please visit McDougall & Brown (", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=denis-richard-young&pid=199564039", "deceased_name": "DENIS RICHARD YOUNG", "year_born_died": null, "message": "\n      YOUNG, DENIS RICHARD 1933 - 2021 It is with great sadness that we announce the passing of Denis Richard Young (age 88) on June 29, 2021, in the city of Nanaimo, British Columbia. He was predeceased by his wife Shirley in February 2015. He is survived by his three sons: Richard, Tom, and David and their wives; grandchildren; and great-grandchildren. Denis was born in Brighton, England and was the oldest of seven siblings. He proudly served his country by enlisting in the Royal Engineers and rose to the rank of Warrant Officer II. After leaving the Army after 10 years, he pursued a successful career in the construction industry where he became a quantity estimator for over 60 years. Dad will be missed by his family and friends, but we are confident that he will ensure that heaven is level and plumb.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=joan-wilson&pid=199552973", "deceased_name": "JOAN WILSON", "year_born_died": null, "message": "\n      WILSON, JOAN (nee FLINT) Passed away peacefully, with her children by her side, on Monday, July 19, 2021. Beloved wife for 40 years of the late Ray Wilson. Devoted and proud mom of Randy (Jane), Janice (Bob), Donnie (Angela), Paul (Angela) and the late Robert. Loving Nonie to Lindsay, Clayton, Robyn, Richard, Katie, Michael, Olivia, Mya, Alicia and Flint. Also proud of her great-grandchildren. Joan was predeceased by her two sisters Donalda and Norma, and two brothers Malcolm and Richard. A special thank you to the staff and her many friends at Tapestry Retirement Home.", "published_source": "Published in Toronto Star on Jul. 23, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=george-wick&pid=199546023", "deceased_name": "GEORGE WICK", "year_born_died": "1931 - 2021", "message": "\n      WICK, GEORGE February 6, 1931 - July 19, 2021 Passed away suddenly at his home in his 91st year. Sorely missed by his devoted wife Lynn, his daughter Joanne and her husband Alan, his son John, and numerous nieces and nephews in Berlin and Munich. Cremation has taken place and a celebration of life will be held at a later date. If desired, memorial donations may be made to the Heart & Stroke Foundation of Ontario. Friends and family may share condolences, stories, and memories, and make donations by visiting ", "published_source": "Published in Toronto Star on Jul. 22, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=hannelore-tsopelas&pid=199503572", "deceased_name": "HANNELORE TSOPELAS", "year_born_died": null, "message": "\n      TSOPELAS, HANNELORE (nee HOELLER) July 18, 2021 Passed away, after a brief illness, in her 89th year. Predeceased by her husband John, after 60 years together, and her brother Helmut. Lovingly remembered by her children Mary-Anna (late David), Sophia (Scott), Edward (Evelyn), Peter (Kelly); her grandchildren and their children Sarah (Andrew), Derek (Sanchia - Micah, Elise, Bethany), Brendan (Rachel), Dan (Dianna - Chase), Alex (Rachel), Allison, Lisa (Kori, Dax), Brock (Alanna), Brittany, and Zach. She will be missed by her sister-in-law Ilse (Theo) and niece Monica (Fred and their children) and her many friends. Our heartfelt thanks to the great staff at Dundurn Place Care Centre in Hamilton, who looked after her so well for the past 3 years. Visitation will be held at HERITAGE FUNERAL CENTRE from 5-7 p.m. A funeral service will be held in the chapel of the funeral home at 7 p.m. Private cremation. Directions and online condolences may be found at: ", "published_source": "Published in Toronto Star on Jul. 20, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=nancy-dora-stewart&pid=199564043", "deceased_name": "NANCY DORA STEWART", "year_born_died": "1947 - 2021", "message": "\n      STEWART, NANCY DORA (nee DOBROWOLSKY) February 27, 1947 – Lachine, Quebec July 16, 2021 – Calgary, Alberta Nancy Dora Stewart passed away peacefully while listening to her favourite song on Friday, July 16, 2021 at 10:30 a.m. with her husband Mark, daughter Laura and son Matthew by her side in Calgary, AB, the place she always wanted to be with her family. Her brother Jerry, sister-in-law Bernie, nephew Erik, brother-in-law Chris, son-in-law Weston, Bubbles, Lucy, Whiskey, Bailey, Kahlua, and the army of her amazing friends and family surrounding her in her life were all there in spirit. Nancy was born on February 27, 1947 in Lachine, QC, and moved to Toronto, ON, with her parents and brother in 1954, where she would build a wonderful life and family. She was an amazing human who would light up the room when she walked in and was the life of the party. There was never a dull moment when Nancy Pants was there! She touched so many people's lives and so many of us share our best memories with her. She was truly the definition of young at heart with her fiery red hair and contagious spirit. She was the best mom, wife, friend, neighbour and person to hug when you were having a bad day. She lived her life dancing, listening to Steely Dan, laughing, playing cards, joking around, and telling stories of all her adventures. Whether it be at Camp Palermo, on the beaches of Cuba, backpacking around Spain, enjoying the rodeo at Stampede, or sitting on the back deck at 68 Evans, Nancy always kept us smiling with her energy in life. We will never forget you Nancy. You are our everything. You are our feather. One day, we will meet you on Ventura Highway, in the sunshine. A Celebration of Life will be held in Toronto when we can all get together safely in the near future. Details of the gathering will be sent to loved ones at a later date. Until then, please remember Nancy and all the joy she brought to our lives, and keep her spirit alive. Condolences, memories and photos may be shared and viewed on Nancy's obituary at ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=mary-spence&pid=199564056", "deceased_name": "MARY SPENCE", "year_born_died": null, "message": "\n      SPENCE, MARY Passed away peacefully, on July 19, 2021, at the age of 92. She now joins her beloved husband George. Loving mother to Tom (Debbie), Laurie (Mark) and David (Diane). Cherished grandmother to Matthew (Samantha) and Jennifer (James). Proud great-grandmother to Hayden and Madelyn. Mary was a secretary for the Durham Board of Education. She worked at the Aldon School for the Special Needs for 13 years and at Woodlands Centennial Public School for 5 years. She volunteered at children's schools. She was a secretary at both the Pickering Figure Skating Club and the Pickering Veterans Association. She was also the Director of Administration for the South Pickering Seniors Club. She was nominated as Senior of the Year for Pickering from 2013- 2014. Online condolences may be made at ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=james-edward-porteous-jim&pid=199546026", "deceased_name": "JAMES EDWARD (JIM) PORTEOUS", "year_born_died": null, "message": "\n      PORTEOUS, JAMES EDWARD (JIM) Peacefully surrounded by his loving family at his home in Orangeville on Tuesday, July 20, 2021 at the age of 80. Beloved husband of Gloria. Dear father of Martin and his wife Kelly and Lisa Leblanc and her husband Darren. Cherished papa of Sandra (Scott), Brian (Rachel), Jamie (Brianna), Jeffrey (Crystal) and Ellie. Proud Pappy of Bryana, Avery, Cadence, Brayden and Simone. Remembered by his sister Margaret Brunt. Jim will also be greatly missed by other relatives and many cherished friends. Visitation will be held at the Dods & McNair Funeral Home, Chapel & Reception Centre, 21 First St., Orangeville on Tuesday, July 27, 2021 from 6:00 to 9:00 p.m. Private Family Funeral Service will be held in the Chapel on Wednesday, July 28, 2021. Memorial donations to the Orangeville Wolves or the Orangeville Northmen Benevolent Fund would be appreciated by the family. A tree will be planted in memory of Jim in the Dods & McNair Memorial Forest at the Island Lake Conservation Area, Orangeville. Condolences may be offered to the family at ", "published_source": "Published in Toronto Star on Jul. 22, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=cornelius-james-knox&pid=199564094", "deceased_name": "Cornelius James KNOX", "year_born_died": "1923 - 2021", "message": "\n      KNOX, Cornelius James June 5, 1923 - July 21, 2021 On July 21, 2021, at the Taunton Mills Retirement home in Whitby, Ontario, Cornelius \"James\" Knox passed peacefully, at the tender age of 98. Loving husband of Linneth Eleanor for 37 years (1946-1983) (Toronto/Willowdale) and another 37 years with loving common-life partner Mildred Bishop (1984-2021) (Toronto/Whitby/Timmins). Loving father of Leslie, Philip, Janet and Lawrence and stepson Sean Bishop and daughters-in-law Bernadette Purchase.and Donna Bartlett. Loving grandpa to Jason, Matthew, Isaac, Richard, Andre, Skye, Justin, Jenelle, Sarah and Corey. Loving great-grandfather to Jahzi, Jalen, Violet, Isaac, Dahlia and Peyton, Najaha, Krista, Janaha, Skylar, Akayla. Family will be receiving guests at the York Cemetery and Funeral Centre (160 Beecroft Rd., Toronto), on Monday, July 26th, visitation from 1-2 p.m. with service from 2-3 p.m. Due to COVID-19 limitations, attendance is by guest list. We are asking friends who would like to attend the visitation to please send an email to Lawrence Knox at laurenceknox1956@gmail.com. In lieu of flowers, donations can be made to the ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=richard-oswald-kalau-georg&pid=199564081", "deceased_name": "RICHARD OSWALD (GEORG) KALAU", "year_born_died": null, "message": "\n      KALAU, RICHARD (GEORG) OSWALD It is with great sadness that we announce the passing of Richard (Georg) Oswald Kalau on July 13, 2021, in Lindsay, Ontario, at the age of 84. Richard is survived by his sons Stephen and Brian and his grandchildren, Olivia, Jonathan and Russell. He was preceded in death by his wife Donna Kalau (nee Williams); his daughter Karen and his brother Fred. He will be remembered fondly by Elizabeth, Michel, and Mark. Richard was born in 1937 in Montreal to Martha and Friedrich Kalau. He graduated McGill University (P. Eng. Mechanical Engineering) and was a man who could fix anything. In 1960, Richard married his high school sweetheart, Donna, a feisty redhead who kept him hopping through life. Richard enjoyed scuba diving, photography, boating and weekends at the property in North Hero, Vermont. In his later years, Richard enjoyed spending time in Florida, reading and playing bridge and cribbage with his friends and family. Richard was a caring husband, devoted father, and loving grandfather. He was a kind man and will be deeply missed by all who knew him. We are hopeful that in his passing, he has been reunited with his loved ones who have passed before him. A memorial gathering for both Donna and Richard will be held August 21st from 1-4 p.m. at Celebrations, 35 Lindsay St. N., Lindsay, ON. In lieu of flowers, donations may be given to CAMH or the ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=john-cushing-ivay&pid=199564092", "deceased_name": "John Cushing IVAY", "year_born_died": null, "message": "\n      IVAY, John Cushing John passed away peacefully at the Bob Rumball Home for the Deaf on June 30, 2021 at the age of 84. Beloved husband of the late Beth, dearest dad of Marlene (Paul) and Cathy (late Larry), most loving grandpa of Daren (Robyn) and Carla (Mitch) and proud great-grandpa of Hunter. The memory of his kind soul and easy smile will always be in the hearts of his surviving family, friends, caregivers and anyone who had the pleasure of meeting John. A memorial service will be held at a later date. Donations to the Bob Rumball Foundation for the Deaf are welcome.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=vernon-winston-farrell-jr&pid=199564085", "deceased_name": "VERNON WINSTON FARRELL Jr.", "year_born_died": "1933 - 2021", "message": "\n      FARRELL JR., VERNON WINSTON October 31, 1933 – July 16, 2021 It is with joy that Michelle, Jacqueline (Roger) and Laurian (Dave) announce that their father lived a wonderful life to its fullest. At 87, Vernon was released from illness and transitioned peacefully to join his loved ones. Vernon is survived by: grandchildren Jasmine, Adam, Malcolm; former spouse Janice Sims-Farrell; siblings Rita, Kathleen, Garnet, Terrence, Charmaine, Carlyle; and a lively troupe of nieces and nephews in Canada, the US, England, Wales and Trinidad & Tobago. He will be remembered by the many students and teachers for whom he deeply cared. Vernon was the loving partner to Lorna Wiggan, who was by his side when he passed. Vernon was a distinguished educator, scholar, a golfer and a traveller. A proud Caribbean and descendant of Africa, he dedicated his life to identifying and dismantling the inequities in Ontario's education system. His passion, his talents, his wisdom and his joyful and playful spirit will be deeply missed by all who knew him. Public visitation will take place on the morning of Wednesday, July 28, 2021 at Marshall Funeral Home, 10366 Yonge Street in Richmond Hill, Ontario. Please visit www. ", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=william-george-durham&pid=199564062", "deceased_name": "William George DURHAM", "year_born_died": "1928 - 2021", "message": "\n      DURHAM, William George 1928 - 2021 It is with heavy hearts we announce the passing of our dad on July 19, 2021, peacefully with his family by his side. Beloved husband of the late Grace Durham. Loving Dad to Barb and Rob (Tish). Adored Grampy to Nicole (Carson), Britt (Mike), Zach and Lucas. Great Grampy to Andy. Fondly remembered by his nieces and nephews. Predeceased by his siblings Ed and Ina. George will be remembered for his great sense of humour his dedication to family and his love for dogs. Many thanks to the caring staff at Fairview Lodge. A private family ceremony will be held with a Celebration of Life at a later date. In lieu of flowers, donations to Parkinson Canada would be appreciated. Gentle, caring, generous man loved for his quick wit.", "published_source": "Published in Toronto Star on Jul. 24, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=gordon-james-douglas&pid=199571783", "deceased_name": "GORDON JAMES DOUGLAS", "year_born_died": "1928 - 2021", "message": "\n      DOUGLAS, GORDON JAMES October 31, 1928 - July 17, 2021 Gordon James Douglas, beloved husband, dad, father, grandpa, and papa, passed away at the age of 92. Gord is survived by his wife and best friend of 70-plus years, Estelle; daughter, Lori and husband Terry; son Paul and wife Cathy; and daughter Joanne and husband Bud. He was also a devoted grandpa to grandsons, Andrew (Carly), Tyler (Stacey), and Landon (Paige) and granddaughters Dalyce (Bruno), Daena and Alyson (Michael). Also missing him will be great-grandchildren, Cole, Lucas and Ashlyn. Gord was an electrician and worked for many years at Comstock Electric. He then moved into Purchasing at Bulldog Electric. Later, he moved on to Garland Commercial Ranges where he was in Sales. It was at Garland that he became part of a team that designed a vent for commercial use that soon became patented. There were not many restaurants the family could enjoy without Gord asking to see the kitchen and educate them on the venting system he was so proud of. After retirement from Garland Ventmaster, Gord and Estelle sold their family home and moved to Alliston, where they lived together for another 30 years before Gord's passing. They enjoyed the company of new friends at Greenbriar and also spent many days of leisure at their cottage at Steenburg Lake, where family would continue to visit. In his last years, Gord was part of the Kingsmere Retirement community. He was well-loved and his spirit will live on in generations to follow. There will be a private service and a Celebration of Life will be held at a later date. \"The Lord turn His face toward you and give you Peace\" www.thomasfuneralhome.ca", "published_source": "Published in Toronto Star on Jul. 25, 2021."},
{"scrapped_date": "2021-07-27 12:26:42", "deceased_url": "http://www.legacy.com/obituaries/thestar/obituary.aspx?n=cecilia-elizabeth-chiarelli&pid=199546021", "deceased_name": "CECILIA ELIZABETH CHIARELLI", "year_born_died": "1931 - 2021", "message": "\n      CHIARELLI, CECILIA ELIZABETH Cecilia Elizabeth Chiarelli, age 89 passed away on Friday, July 16, 2021. Cecilia was born July 23, 1931 in Kirkland Lake, Ontario. Beloved wife of the late John \"Jack\" Chiarelli (2008). Dear mother of David Chiarelli (Janet) and Mary Anne. Loved grandmother of Daniel Chiarelli, Andrew, Ryan (Jacqueline), and Katrina Steinman, and great-grandmother of Ezra John and Elias Yvon Steinman. Dear sister-in-law of Georgette Moore and Isabelle Chiarelli. \"Aunt Toots\" is fondly remembered by many nieces, nephews and friends. Predeceased by her parents Albert and Mary (née Taylor) Shanks, her sister Evelyn Palmer, and her brother George Shanks. Cecilia's family will receive relatives and friends at Westmount Memorial Celebration Centre, 1001 Ottawa St. S., Kitchener, (519-743-8900), on Tuesday, July 27, 2021, from 10:00 - 10:45 a.m., where the Funeral Liturgy will be held in the chapel at 11:00 a.m., with Father Larry Parent officiating. Cremation to follow. Interment later at St. Francis Xavier Cemetery, Renfrew. In lieu of flowers, contributions in Cecilia's memory may be made to Alzheimer Society of Waterloo Wellington, 831 Frederick St., Kitchener, ON N2B 2B4 or to the Heart & Stroke Foundation, 1300 - 2300 Yonge St., Toronto, ON M4P 1E4. The family wishes to express their sincere appreciation to the staff on the 2nd Floor of Extendicare Falconbridge, Sudbury. Fond memories and expressions of sympathy may be shared at ", "published_source": "Published in Toronto Star on Jul. 22, 2021."}
]